BpelOrchestrator/test/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://composer">
   <soapenv:Header/>
   <soapenv:Body>
      <com:process>
         <origin>Iasi</origin>
         <destination>London</destination>
         <types>food</types>
         <radius>1000</radius>
         <key>AIzaSyDtfFjvrCJqIThah6qy_TxmljHfChEzHpQ</key>
         <sensor>false</sensor>
         <mode>xml</mode>
      </com:process>
   </soapenv:Body>
</soapenv:Envelope>